Infineon/micropython-psoc-edge/ports/psoc-edge/machine_counter.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2026 Infineon Technologies AG
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "py/obj.h"
#include "py/runtime.h"
#include "py/mphal.h"

#include "modmachine.h"
#include "machine_pin.h"
#include "tcpwm.h"

#include "cy_gpio.h"
#include "cy_sysclk.h"
#include "cy_trigmux.h"
#include "cy_tcpwm_counter.h"
#include "cy_tcpwm.h"
#include "cycfg_peripheral_clocks.h"
#include "mtb_hal.h"

#include "genhdr/pins_af.h"
#include "sys_int.h"

// Reuse machine.Pin IRQ API to implement Counter index input callbacks.
extern mp_obj_t machine_pin_irq(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args);

// Number of Counter object slots supported by this port.
#define MACHINE_COUNTER_NUM_INSTANCES  (32)
// Shared TCPWM source clock frequency used by Counter.
#define COUNTER_CLK_HZ                 (1000000UL)
// Value used to disable optional TCPWM trigger inputs.
#define COUNTER_INPUT_DISABLED         (0x7U)

typedef enum {
    COUNTER_EDGE_RISING = 1,
    COUNTER_EDGE_FALLING = 2,
} machine_counter_edge_t;

typedef enum {
    COUNTER_DIR_UP = 1,
    COUNTER_DIR_DOWN = 2,
} machine_counter_dir_t;

typedef struct _machine_counter_obj_t {
    mp_obj_base_t base;
    uint8_t id;
    uint32_t counter_num;
    en_clk_dst_t pclk_dst;
    mp_hal_pin_obj_t src_pin;
    const machine_pin_obj_t *index_pin;
    const machine_pin_obj_t *reset_pin;
    uint8_t edge;
    uint8_t direction;
    uint32_t range_min;
    uint32_t range_max;
    uint16_t cycles_u16;
    mp_int_t offset;
    mp_obj_t index_irq_obj;
    mp_obj_t reset_irq_obj;
    sys_int_cfg_t irq_cfg;
    bool irq_active;
    bool configured;
} machine_counter_obj_t;

// One Counter object per hardware id.
static machine_counter_obj_t *counter_obj[MACHINE_COUNTER_NUM_INSTANCES] = { NULL };
static bool machine_counter_clock_configured = false;

// ---------------------------------------------------------------------------
// Per-ID hardware mapping from generated AF data.
// ---------------------------------------------------------------------------

// Expands generated map entries into id->hardware-counter lookup.
#define COUNTER_HW_ENTRY(id, counter, irq, pclk, trig) counter,
static const uint32_t counter_hw[MACHINE_COUNTER_NUM_INSTANCES] = {
    MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_HW_ENTRY)
};
#undef COUNTER_HW_ENTRY

// Expands generated map entries into id->output-trigger-line lookup.
#define COUNTER_OUT_TRIG_ENTRY(id, counter, irq, pclk, trig) trig,
static const uint32_t counter_out_trig[MACHINE_COUNTER_NUM_INSTANCES] = {
    MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_OUT_TRIG_ENTRY)
};
#undef COUNTER_OUT_TRIG_ENTRY

// Expands generated map entries into id->counter-IRQ lookup.
#define COUNTER_IRQ_ENTRY(id, counter, irq, pclk, trig) irq,
static const IRQn_Type counter_irq[MACHINE_COUNTER_NUM_INSTANCES] = {
    MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_IRQ_ENTRY)
};
#undef COUNTER_IRQ_ENTRY

// ---------------------------------------------------------------------------
// Helpers
// ---------------------------------------------------------------------------

// Configure the shared peripheral clock once for all Counter objects.
static void machine_counter_configure_clock(void) {
    if (machine_counter_clock_configured) {
        return;
    }

    cy_rslt_t rslt = mtb_hal_clock_set_peri_clock_freq(&CYBSP_GENERAL_PURPOSE_TIMER_clock_ref,
        COUNTER_CLK_HZ, 1000);
    if (rslt != CY_RSLT_SUCCESS) {
        mp_raise_msg_varg(&mp_type_ValueError,
            MP_ERROR_TEXT("Counter clock setup failed (0x%lx)"),
            (unsigned long)rslt);
    }

    machine_counter_clock_configured = true;
}

// Return the max period for this counter width (16-bit or 32-bit).
static uint32_t machine_counter_period_max(uint32_t counter_num) {
    return (counter_num >= 256U) ? 0xFFFFU : UINT32_MAX;
}

/**
 * TODO:
 * The TrigMux functionality might be required for other modules,
 * and these definitions might be move in the future to a separate
 * c file to be shared by other modules.
 * Only PERI0 is used here, but PERI1 is also available and could
 * be used.
 */
#define MAP_COUNTER_PIN_INPUT_TRIGGER(id) \
    [id] = PERI_0_TRIG_IN_MUX_3_PERI0_HSIOM_TR_OUT##id,

static const en_peri0_trig_input_debugreducation1_t peri0_tr_io_input[MICROPY_PY_MACHINE_PERI0_TR_IO_INPUT_NUM_ENTRIES] = {
    MICROPY_PY_MACHINE_FOR_ALL_PERI0_TR_IO_INPUTS(MAP_COUNTER_PIN_INPUT_TRIGGER)
};

// Restore the routed source pin back to GPIO input mode.
static void machine_counter_restore_src_pin(machine_counter_obj_t *self) {
    if (self->src_pin == NULL) {
        return;
    }
    GPIO_PRT_Type *port = Cy_GPIO_PortToAddr(self->src_pin->port);
    Cy_GPIO_SetHSIOM(port, self->src_pin->pin, HSIOM_SEL_GPIO);
    Cy_GPIO_SetDrivemode(port, self->src_pin->pin, CY_GPIO_DM_HIGHZ);
    self->src_pin = NULL;
}

// Disable the underlying TCPWM counter channel.
static void machine_counter_stop_hw(machine_counter_obj_t *self) {
    Cy_TCPWM_Counter_Disable(TCPWM0, self->counter_num);
}

