Infineon/micropython-psoc-edge/ports/psoc-edge/machine_counter.c
// Disable index/reset pin IRQs (if configured) and release pin ownership.
static void machine_counter_disable_aux_irqs(machine_counter_obj_t *self) {
    // Disable index pin IRQs (if configured) and release pin ownership.
    if (self->index_pin != NULL && self->index_irq_obj != MP_OBJ_NULL) {
        mp_obj_t pos_args[] = {
            MP_OBJ_FROM_PTR((machine_pin_obj_t *)self->index_pin),
            mp_const_none,
        };
        mp_map_t kw_args;
        mp_map_init_fixed_table(&kw_args, 0, NULL);
        machine_pin_irq(2, pos_args, &kw_args);
    }

    // Disable reset pin IRQs (if configured) and release pin ownership.
    if (self->reset_pin != NULL && self->reset_irq_obj != MP_OBJ_NULL
        && self->reset_pin != self->index_pin) {
        mp_obj_t pos_args[] = {
            MP_OBJ_FROM_PTR((machine_pin_obj_t *)self->reset_pin),
            mp_const_none,
        };
        mp_map_t kw_args;
        mp_map_init_fixed_table(&kw_args, 0, NULL);
        machine_pin_irq(2, pos_args, &kw_args);
    }

    self->index_pin = NULL;
    self->reset_pin = NULL;
    self->index_irq_obj = MP_OBJ_NULL;
    self->reset_irq_obj = MP_OBJ_NULL;
}

// Disable and unregister the counter IRQ if it is currently active.
static void machine_counter_stop_irq(machine_counter_obj_t *self) {
    if (self->irq_active) {
        sys_int_deinit(&self->irq_cfg);
        self->irq_active = false;
    }
}

// Return the cycles counter as signed 16-bit value.
static inline int16_t machine_counter_cycles_get(const machine_counter_obj_t *self) {
    return (int16_t)self->cycles_u16;
}

// Increment/decrement cycles counter with 16-bit wrap semantics.
static inline void machine_counter_cycles_step(machine_counter_obj_t *self) {
    if (self->direction == COUNTER_DIR_DOWN) {
        self->cycles_u16--;
    } else {
        self->cycles_u16++;
    }
}

// Counter terminal-count ISR: track wrap events in software cycles.
static void machine_counter_isr(machine_counter_obj_t *self) {
    if (Cy_TCPWM_GetInterruptStatus(TCPWM0, self->counter_num) & CY_TCPWM_INT_ON_TC) {
        Cy_TCPWM_ClearInterrupt(TCPWM0, self->counter_num, CY_TCPWM_INT_ON_TC);
        machine_counter_cycles_step(self);
    }
}

// Shared handler for index/reset pin rising edges.
// If update_cycles is true (index), adjust cycles;
// if false (reset), keep cycles unchanged.
static inline void machine_counter_on_aux_event(machine_counter_obj_t *self, bool update_cycles) {
    if (!self->configured) {
        return;
    }

    mp_uint_t irq_state = MICROPY_BEGIN_ATOMIC_SECTION();
    if (update_cycles) {
        // Update cycles counter on index pin rising edge.
        machine_counter_cycles_step(self);
    }
    Cy_TCPWM_Counter_SetCounter(TCPWM0, self->counter_num, 0);
    Cy_TCPWM_ClearInterrupt(TCPWM0, self->counter_num, CY_TCPWM_INT_ON_TC);
    MICROPY_END_ATOMIC_SECTION(irq_state);
}

// -------------------------------------------------------------------------- //
// Generate one IRQ handler per Counter id for direct dispatch.
#define COUNTER_IRQ_HANDLER_DECL(id, counter, irq, pclk, trig) \
    static void machine_counter_irq_handler_##id(void) { \
        machine_counter_obj_t *self = counter_obj[id]; \
        if (self != NULL) { \
            machine_counter_isr(self); \
        } \
    }
MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_IRQ_HANDLER_DECL)
#undef COUNTER_IRQ_HANDLER_DECL

// Generate one IRQ handler entry per Counter id for direct dispatch.
#define COUNTER_IRQ_HANDLER_ENTRY(id, counter, irq, pclk, trig) machine_counter_irq_handler_##id,
static const cy_israddress machine_counter_irq_handlers[MACHINE_COUNTER_NUM_INSTANCES] = {
    MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_IRQ_HANDLER_ENTRY)
};
#undef COUNTER_IRQ_HANDLER_ENTRY
// -------------------------------------------------------------------------- //

// -------------------------------------------------------------------------- //
// Generate one index callback per Counter id (bound through machine.Pin.irq).
#define COUNTER_INDEX_HANDLER_DECL(id, counter, irq, pclk, trig) \
    static mp_obj_t machine_counter_index_handler_##id(mp_obj_t pin_in) { \
        (void)pin_in; \
        machine_counter_obj_t *self = counter_obj[id]; \
        if (self != NULL && self->index_pin != NULL) { \
            machine_counter_on_aux_event(self, true); \
        } \
        return mp_const_none; \
    }
MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_INDEX_HANDLER_DECL)
#undef COUNTER_INDEX_HANDLER_DECL

// Generate one index callback object per Counter id (bound through machine.Pin.irq).
#define COUNTER_INDEX_HANDLER_OBJ_DECL(id, counter, irq, pclk, trig) \
    static MP_DEFINE_CONST_FUN_OBJ_1(machine_counter_index_handler_obj_##id, machine_counter_index_handler_##id);
MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_INDEX_HANDLER_OBJ_DECL)
#undef COUNTER_INDEX_HANDLER_OBJ_DECL

// Generate one index callback object entry per Counter id (bound through machine.Pin.irq).
#define COUNTER_INDEX_HANDLER_OBJ_ENTRY(id, counter, irq, pclk, trig) MP_OBJ_FROM_PTR(&machine_counter_index_handler_obj_##id),
static const mp_obj_t machine_counter_index_handler_obj[MACHINE_COUNTER_NUM_INSTANCES] = {
    MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_INDEX_HANDLER_OBJ_ENTRY)
};
#undef COUNTER_INDEX_HANDLER_OBJ_ENTRY
// -------------------------------------------------------------------------- //

// -------------------------------------------------------------------------- //
// Generate one reset callback per Counter id (bound through machine.Pin.irq).
#define COUNTER_RESET_HANDLER_DECL(id, counter, irq, pclk, trig) \
    static mp_obj_t machine_counter_reset_handler_##id(mp_obj_t pin_in) { \
        (void)pin_in; \
        machine_counter_obj_t *self = counter_obj[id]; \
        if (self != NULL && self->reset_pin != NULL) { \
            machine_counter_on_aux_event(self, false); \
        } \
        return mp_const_none; \
    }
MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_RESET_HANDLER_DECL)
#undef COUNTER_RESET_HANDLER_DECL

// Generate one reset callback object per Counter id (bound through machine.Pin.irq).
#define COUNTER_RESET_HANDLER_OBJ_DECL(id, counter, irq, pclk, trig) \
    static MP_DEFINE_CONST_FUN_OBJ_1(machine_counter_reset_handler_obj_##id, machine_counter_reset_handler_##id);
MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_RESET_HANDLER_OBJ_DECL)
#undef COUNTER_RESET_HANDLER_OBJ_DECL

