Infineon/micropython-psoc-edge/ports/psoc-edge/machine_counter.c
// Generate one reset callback object entry per Counter id (bound through machine.Pin.irq).
#define COUNTER_RESET_HANDLER_OBJ_ENTRY(id, counter, irq, pclk, trig) MP_OBJ_FROM_PTR(&machine_counter_reset_handler_obj_##id),
static const mp_obj_t machine_counter_reset_handler_obj[MACHINE_COUNTER_NUM_INSTANCES] = {
    MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_RESET_HANDLER_OBJ_ENTRY)
};
#undef COUNTER_RESET_HANDLER_OBJ_ENTRY
// -------------------------------------------------------------------------- //

// -------------------------------------------------------------------------- //
// If index and reset share a pin, run both semantics from a single callback.
#define COUNTER_INDEX_RESET_HANDLER_DECL(id, counter, irq, pclk, trig) \
    static mp_obj_t machine_counter_index_reset_handler_##id(mp_obj_t pin_in) { \
        (void)pin_in; \
        machine_counter_obj_t *self = counter_obj[id]; \
        if (self != NULL) { \
            if (self->index_pin != NULL) { \
                machine_counter_on_aux_event(self, true); \
            } \
            if (self->reset_pin != NULL) { \
                machine_counter_on_aux_event(self, false); \
            } \
        } \
        return mp_const_none; \
    }
MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_INDEX_RESET_HANDLER_DECL)
#undef COUNTER_INDEX_RESET_HANDLER_DECL

// Generate one index/reset callback object per Counter id (bound through machine.Pin.irq).
#define COUNTER_INDEX_RESET_HANDLER_OBJ_DECL(id, counter, irq, pclk, trig) \
    static MP_DEFINE_CONST_FUN_OBJ_1(machine_counter_index_reset_handler_obj_##id, machine_counter_index_reset_handler_##id);
MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_INDEX_RESET_HANDLER_OBJ_DECL)
#undef COUNTER_INDEX_RESET_HANDLER_OBJ_DECL

// Generate one index/reset callback object entry per Counter id (bound through machine.Pin.irq).
#define COUNTER_INDEX_RESET_HANDLER_OBJ_ENTRY(id, counter, irq, pclk, trig) MP_OBJ_FROM_PTR(&machine_counter_index_reset_handler_obj_##id),
static const mp_obj_t machine_counter_index_reset_handler_obj[MACHINE_COUNTER_NUM_INSTANCES] = {
    MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_INDEX_RESET_HANDLER_OBJ_ENTRY)
};
#undef COUNTER_INDEX_RESET_HANDLER_OBJ_ENTRY

// -------------------------------------------------------------------------- //

// Roll back Counter state and release channel ownership after init failure.
static void machine_counter_init_fail_cleanup(machine_counter_obj_t *self) {
    machine_counter_stop_hw(self);
    machine_counter_stop_irq(self);
    machine_counter_disable_aux_irqs(self);
    machine_counter_restore_src_pin(self);
    self->configured = false;
    self->cycles_u16 = 0;
    self->offset = 0;

    machine_tcpwm_counter_free(self->counter_num, MP_OBJ_FROM_PTR(self));
    counter_obj[self->id] = NULL;
}

// Parse init args and configure routing, trigger mux, and TCPWM hardware.
static void machine_counter_init_helper_impl(machine_counter_obj_t *self,
    size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {

    enum {
        ARG_src,
        ARG_edge,
        ARG_direction,
        ARG_filter_ns,
        ARG_max,
        ARG_min,
        ARG_index,
        ARG_reset,
        ARG_match,
        ARG_match_pin,
    };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_src, MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_edge, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = COUNTER_EDGE_RISING} },
        { MP_QSTR_direction, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = COUNTER_DIR_UP} },
        { MP_QSTR_filter_ns, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_max, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_min, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_index, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_reset, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_match, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_match_pin, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args,
        MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    uint8_t edge = args[ARG_edge].u_int;
    if (edge != COUNTER_EDGE_RISING && edge != COUNTER_EDGE_FALLING) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid edge"));
    }

    uint8_t direction = args[ARG_direction].u_int;
    if (direction != COUNTER_DIR_UP && direction != COUNTER_DIR_DOWN) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid direction"));
    }

    mp_int_t filter_ns = args[ARG_filter_ns].u_int;
    if (filter_ns < 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("filter_ns must be >= 0"));
    }
    if (filter_ns > 0) {
        mp_raise_NotImplementedError(MP_ERROR_TEXT("filter_ns not supported"));
    }

    mp_int_t min = args[ARG_min].u_int;
    if (min < 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("min must be >= 0"));
    }

    const machine_pin_obj_t *index_pin = NULL;
    if (args[ARG_index].u_obj != mp_const_none) {
        index_pin = mp_hal_get_pin_obj(args[ARG_index].u_obj);
    }
    const machine_pin_obj_t *reset_pin = NULL;
    if (args[ARG_reset].u_obj != mp_const_none) {
        reset_pin = mp_hal_get_pin_obj(args[ARG_reset].u_obj);
    }
    if (args[ARG_match].u_obj != mp_const_none) {
        mp_raise_NotImplementedError(MP_ERROR_TEXT("match not supported"));
    }
    if (args[ARG_match_pin].u_obj != mp_const_none) {
        mp_raise_NotImplementedError(MP_ERROR_TEXT("match_pin not supported"));
    }

    uint32_t max_hw = machine_counter_period_max(self->counter_num);
    uint32_t range_max = max_hw;
    if (args[ARG_max].u_obj != mp_const_none) {
        mp_int_t max = mp_obj_get_int(args[ARG_max].u_obj);
        if (max < 0) {
            mp_raise_ValueError(MP_ERROR_TEXT("max must be >= 0"));
        }
        if (max == 0 && min == 0) {
            range_max = max_hw;
        } else if ((uint64_t)max > (uint64_t)max_hw) {
            mp_raise_ValueError(MP_ERROR_TEXT("max out of range"));
        } else {
            range_max = (uint32_t)max;
        }
    }

