Infineon/micropython-psoc-edge/ports/psoc-edge/machine_counter.c
// Wrapper that enforces identical rollback semantics for constructor and init().
static void machine_counter_init_helper(machine_counter_obj_t *self,
    size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {

    nlr_buf_t nl;
    if (nlr_push(&nl) == 0) {
        machine_counter_init_helper_impl(self, n_args, pos_args, kw_args);
        nlr_pop();
    } else {
        machine_counter_init_fail_cleanup(self);
        nlr_jump(nl.ret_val);
    }
}

// ---------------------------------------------------------------------------
// Constructor: Counter(id, ...)
// ---------------------------------------------------------------------------

// Create a Counter object, reserve hardware, and run optional init.
static mp_obj_t machine_counter_make_new(const mp_obj_type_t *type,
    size_t n_args, size_t n_kw, const mp_obj_t *args) {

    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);

    mp_int_t id = mp_obj_get_int(args[0]);
    if (id < 0 || id >= MACHINE_COUNTER_NUM_INSTANCES) {
        mp_raise_msg_varg(&mp_type_ValueError,
            MP_ERROR_TEXT("Counter id must be in range 0-%d"),
            MACHINE_COUNTER_NUM_INSTANCES - 1);
    }

    if (counter_obj[id] != NULL) {
        mp_raise_msg_varg(&mp_type_ValueError,
            MP_ERROR_TEXT("Counter(%u) already created."), (unsigned)id);
    }

    machine_counter_obj_t *self = mp_obj_malloc(machine_counter_obj_t, &machine_counter_type);
    counter_obj[id] = self;

    self->id = (uint8_t)id;
    self->counter_num = counter_hw[id];
    self->pclk_dst = machine_tcpwm_counter_pclk(self->counter_num);
    self->src_pin = NULL;
    self->index_pin = NULL;
    self->reset_pin = NULL;
    self->edge = COUNTER_EDGE_RISING;
    self->direction = COUNTER_DIR_UP;
    self->range_min = 0;
    self->range_max = machine_counter_period_max(self->counter_num);
    self->cycles_u16 = 0;
    self->offset = 0;
    self->index_irq_obj = MP_OBJ_NULL;
    self->reset_irq_obj = MP_OBJ_NULL;
    self->irq_cfg.irq_num = counter_irq[id];
    self->irq_active = false;
    self->configured = false;

    nlr_buf_t nl;
    if (nlr_push(&nl) == 0) {
        machine_tcpwm_counter_alloc(self->counter_num, MP_OBJ_FROM_PTR(self));
        nlr_pop();
    } else {
        counter_obj[id] = NULL;
        nlr_jump(nl.ret_val);
    }

    if (n_args > 1 || n_kw > 0) {
        mp_map_t kw_map;
        mp_map_init_fixed_table(&kw_map, n_kw, args + n_args);
        machine_counter_init_helper(self, n_args - 1, args + 1, &kw_map);
    }

    return MP_OBJ_FROM_PTR(self);
}

// ---------------------------------------------------------------------------
// counter.init(src, *, edge=, direction=)
// ---------------------------------------------------------------------------

// Python binding for Counter.init(...).
static mp_obj_t machine_counter_init(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args) {
    machine_counter_init_helper(MP_OBJ_TO_PTR(args[0]), n_args - 1, args + 1, kw_args);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(machine_counter_init_obj, 1, machine_counter_init);

// ---------------------------------------------------------------------------
// counter.deinit()
// ---------------------------------------------------------------------------

// Python binding for Counter.deinit().
static mp_obj_t machine_counter_deinit(mp_obj_t self_in) {
    machine_counter_obj_t *self = MP_OBJ_TO_PTR(self_in);

    machine_counter_stop_hw(self);
    machine_counter_stop_irq(self);
    machine_counter_disable_aux_irqs(self);
    machine_counter_restore_src_pin(self);

    self->configured = false;
    self->cycles_u16 = 0;
    self->offset = 0;

    machine_tcpwm_counter_free(self->counter_num, MP_OBJ_FROM_PTR(self));
    counter_obj[self->id] = NULL;

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_counter_deinit_obj, machine_counter_deinit);

// Module-level lifecycle called from machine_deinit().
void machine_counter_deinit_all(void) {
    for (uint8_t i = 0; i < MACHINE_COUNTER_NUM_INSTANCES; i++) {
        machine_counter_obj_t *self = counter_obj[i];
        if (self != NULL) {
            machine_counter_deinit(MP_OBJ_FROM_PTR(self));
        }
    }
}

// ---------------------------------------------------------------------------
// counter.value([value])
// ---------------------------------------------------------------------------

// Return current count, or reset logical origin when a value is provided.
static mp_obj_t machine_counter_value(size_t n_args, const mp_obj_t *args) {
    machine_counter_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    if (!self->configured) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("not initialised"));
    }

    if (n_args == 2) {
        // Freeze counting during read/reset so no new edges arrive in this window.
        Cy_TCPWM_Counter_Disable(TCPWM0, self->counter_num);
    }

    uint32_t raw = Cy_TCPWM_Counter_GetCounter(TCPWM0, self->counter_num);
    uint64_t span = (uint64_t)(self->range_max - self->range_min) + 1ULL;
    int16_t cycles = machine_counter_cycles_get(self);
    long long edge_total;
    if (self->direction == COUNTER_DIR_DOWN) {
        edge_total = (long long)(-cycles) * (long long)span + (long long)raw;
        edge_total = -edge_total;
    } else {
        edge_total = (long long)cycles * (long long)span + (long long)raw;
    }
    long long result = (long long)self->offset + edge_total;

    if (n_args == 2) {
        self->offset = mp_obj_get_int(args[1]);
        self->cycles_u16 = 0;
        Cy_TCPWM_Counter_SetCounter(TCPWM0, self->counter_num, 0);
        Cy_TCPWM_ClearInterrupt(TCPWM0, self->counter_num, CY_TCPWM_INT_ON_TC);
        Cy_TCPWM_Counter_Enable(TCPWM0, self->counter_num);
        Cy_TCPWM_TriggerReloadOrIndex_Single(TCPWM0, self->counter_num);
    }

    return mp_obj_new_int_from_ll(result);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_counter_value_obj, 1, 2, machine_counter_value);

// ---------------------------------------------------------------------------
// counter.cycles([value])
// ---------------------------------------------------------------------------

// Get or set the signed 16-bit software cycles counter.
static mp_obj_t machine_counter_cycles(size_t n_args, const mp_obj_t *args) {
    machine_counter_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    if (!self->configured) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("not initialised"));
    }

    int16_t prev = machine_counter_cycles_get(self);

    if (n_args == 2) {
        mp_int_t value = mp_obj_get_int(args[1]);
        if (value < -32768 || value > 32767) {
            mp_raise_ValueError(MP_ERROR_TEXT("cycles out of range"));
        }
        self->cycles_u16 = (uint16_t)(int16_t)value;
    }

    return mp_obj_new_int(prev);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_counter_cycles_obj, 1, 2, machine_counter_cycles);

