Infineon/micropython-psoc-edge/ports/psoc-edge/machine_counter.c
// Print user-facing representation as Counter(<id>).
static void machine_counter_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_counter_obj_t *self = MP_OBJ_TO_PTR(self_in);
    const char *edge_str = (self->edge == COUNTER_EDGE_FALLING) ? "FALLING" : "RISING";
    const char *dir_str = (self->direction == COUNTER_DIR_DOWN) ? "DOWN" : "UP";

    if (self->src_pin == NULL) {
        mp_printf(print, "Counter(id=%u, src=None, edge=Counter.%s, direction=Counter.%s)",
            (unsigned)self->id, edge_str, dir_str);
    } else {
        mp_printf(print, "Counter(id=%u, src=%q, edge=Counter.%s, direction=Counter.%s)",
            (unsigned)self->id, self->src_pin->name, edge_str, dir_str);
    }
}

static const mp_rom_map_elem_t machine_counter_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_init), MP_ROM_PTR(&machine_counter_init_obj) },
    { MP_ROM_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&machine_counter_deinit_obj) },
    { MP_ROM_QSTR(MP_QSTR_value), MP_ROM_PTR(&machine_counter_value_obj) },
    { MP_ROM_QSTR(MP_QSTR_cycles), MP_ROM_PTR(&machine_counter_cycles_obj) },

    { MP_ROM_QSTR(MP_QSTR_RISING), MP_ROM_INT(COUNTER_EDGE_RISING) },
    { MP_ROM_QSTR(MP_QSTR_FALLING), MP_ROM_INT(COUNTER_EDGE_FALLING) },
    { MP_ROM_QSTR(MP_QSTR_UP), MP_ROM_INT(COUNTER_DIR_UP) },
    { MP_ROM_QSTR(MP_QSTR_DOWN), MP_ROM_INT(COUNTER_DIR_DOWN) },
};
static MP_DEFINE_CONST_DICT(machine_counter_locals_dict, machine_counter_locals_dict_table);

MP_DEFINE_CONST_OBJ_TYPE(
    machine_counter_type,
    MP_QSTR_Counter,
    MP_TYPE_FLAG_NONE,
    make_new, machine_counter_make_new,
    print, machine_counter_print,
    locals_dict, &machine_counter_locals_dict
    );
